Repository: 68foxboris/enigma2-plugin-youtube
Catalog: po/*.po
Languages: fi, hu

source: dislikes
fi: ei tykkää

source: likes
fi: tykkää
hu: kedvel

source: views
fi: näyttökertaa
hu: nézetek

source: Active video downloads
fi: Aktiivisia videolatauksia
hu: Aktív videó letöltések

source: Add to favorites
fi: Lisää suosikkeihin
hu: Hozzáadás a kedvencekhez

source: Added!
fi: Lisätty!
hu: Hozzáadott!

source: All
fi: Kaikki
hu: összes

source: Ask user
fi: Kysytään mitä tehdään
hu: Kérje a felhasználót

source: Brazil
fi: Brasilia

source: Canada
fi: Kanada

source: Cancel
fi: Peruuta
hu: töröl

source: Choose what you want to do
fi: Valitse mitä haluat tehdä
hu: Válassza ki, mit szeretne

source: Close YouTube
fi: Sulje YouTube
hu: Zárd be a YouTube-ot

source: Created date
fi: Luontipäivä
hu: Létrehozás dátuma

source: Czech Republic
fi: Tsekin tasavalta

source: Delete this entry
fi: Poista tämä valinta
hu: Törölje ezt a bejegyzést

source: Disliked!
fi: Ei tykätty!
hu: Nem tetszett!

source: Download directory:
fi: Latauskansio:
hu: Letöltési Könyvtár

source: Download feed entries. Please wait...
fi: Ladataan syötteitä. Odota...
hu: Feed bejegyzések letöltése. Kérlek várj...

source: Download search results. Please wait...
fi: Ladataan hakutuloksia. Odota...
hu: A keresési eredmények letöltése. Kérlek várj...

source: Download video
fi: Lataa video
hu: Videó letöltése

source: Downloading
fi: Ladataan
hu: Letöltés

source: Duration:
fi: Kesto:
hu: Időtartam:

source: Embedded in webpages
fi: Internetsivujen videot
hu: Beágyazva weboldalak

source: Exclude restricted content:
fi: Hylkää rajoitettu sisältö
hu: Korlátozott tartalom kizárása:

source: Exit
fi: Poistu
hu: Kilépés

source: Extract video url. Please wait...
fi: Haetaan videon url-osoitetta. Odota...
hu: Videó url kibontása. Kérem várjon ...

source: Favorites
fi: Suosikit
hu: Kedvencek

source: France
fi: Ranska

source: Germany
fi: Saksa

source: Go to %s And enter the code %s
fi: Mene %s Ja syötä koodi %s
hu: Kérem %s írja be a kódot %s

source: Great Britain
fi: Iso-Britannia

source: HD videos
fi: HD videot
hu: HD videók

source: History
fi: Historia

source: Holland
fi: Hollanti

source: How many search results will be returned. If greater value then longer time will be needed for thumbnail download.
fi: Kuinka monta hakutulosta noudetaan. Mitä suurempi luku sitä pidempään haku kestää.
hu: Hány keresési eredményt kap vissza. Ha nagyobb értékre van szükség, akkor hosszabb időre van szükség a miniatűrök letöltéséhez.

source: I dislike this
fi: En tykkää tästä
hu: Nem szeretem ezt

source: I like this
fi: Tykkään tästä
hu: Ez tetszik

source: India
fi: Intia

source: Ireland
fi: Irlanti

source: Italy
fi: Italia

source: Japan
fi: Japani

source: Keyboard
fi: Näppäimistö
hu: Billentyűzet

source: Liked videos
fi: Tykätyt videot
hu: Tetszett videó

source: Liked!
fi: Tykätty!
hu: Tetszett!

source: Log in to your YouTube account when plugin starts. This needs to approve in the Google home page!
fi: Kirjaudu sisään YouTube tililläsi kun plugin käynnistyy. Tämä vaatii hyväksynnän Googlen kotisivuilta!

source: Login on startup:
fi: Kirjaudu käynnistettäessä
hu: Bejelentkezés az indításkor:

source: Maximum video resolution:
fi: Maksimi video resoluutio
hu: Maximális videó felbontás:

source: Mexico
fi: Meksiko

source: Moderate
fi: Keskinkertainen
hu: Mérsékelt

source: Most viewed
fi: Eniten katsotut
hu: Legnézettebb

source: Movies
fi: Elokuvat
hu: Filmek

source: My Subscriptions
fi: Minun seuraamat
hu: Saját előfizetések

source: My feeds
fi: Minun syötteet
hu: Saját feedek

source: New Zealand
fi: Uusi-Seelanti

source: Next %s entries
fi: Seuraavat %s sisällöt
hu: Következő %s bejegyzések

source: No
fi: Ei
hu: Nem

source: No, but play video again
fi: Ei, mutta toista video uudestaan
hu: Nem, de újra játssza le a videót

source: Open
fi: Avaa
hu: Megnyitás

source: Order in which search results will be displayed.
fi: Järjestys jossa hakutulokset näytetään
hu: A keresési eredmények megjelenítésének sorrendje.

source: Play next
fi: Toista seuraava
hu: A következő lejátszása

source: Play next video
fi: Toista seuraava video
hu: A következő videó lejátszása

source: Play previous video
fi: Toista edellinen video
hu: Az előző videó lejátszása

source: Play video again
fi: Toista video uudestaan
hu: Videó lejátszása

source: Playlists
fi: Toistolista
hu: Lejátszási listák

source: Please select the download directory
fi: Valitse latauskansio
hu: Válassza ki a letöltési könyvtárat

source: Poland
fi: Puola

source: Previous %s entries
fi: Edelliset %s sisällöt
hu: Előző %s bejegyzések

source: Public feeds
fi: Luokitellut videot
hu: Nyilvános hírcsatornák

source: Published at:
fi: Julkaistu:
hu: Publikálva:

source: Quit
fi: Poistu
hu: Kilép

source: Rate video
fi: Arvostele video
hu: Értékeld a videót

source: Rating
fi: Arvostelu
hu: Értékelés

source: Rating removed!
fi: Arvostelu poistettu!
hu: Értékelés eltávolítva!

source: Recent
fi: Viimeisimmät
hu: Friss

source: Relevance
fi: Vastaavuus
hu: fontosság

source: Remove from favorites
fi: Poista suosikeista
hu: Eltávolítás a kedvencekből

source: Remove my rating
fi: Poista arvosteluni
hu: Távolítsa el a minősítésemet

source: Removed!
fi: Poistettu!
hu: Eltávolított!

source: Repeat
fi: Toista uudelleen
hu: Ismétlés

source: Return search results for the specified country.
fi: Hae tietystä maasta
hu: Adja meg a megadott ország keresési eredményeit.

source: Return search results that are most relevant to the specified language.
fi: Hae tietyllä kielellä
hu: A megadott nyelvhez leginkább megfelelő keresési eredményeket jeleníti meg.

source: Return to list
fi: Palaa listaan
hu: Vissza a listához

source: Russia
fi: Venäjä

source: Save search result:
fi: Tallenna hakutulos
hu: Keresés mentése:

source: Save your search result in the history, when search completed.
fi: Tallenna hakusi hakuhistoriaan kun haku on valmis
hu: Mentse a keresési eredményt a történelemben, amikor a keresés befejeződött.

source: Search
fi: Hae
hu: Keresés

source: Search channels
fi: Hae kanavia
hu: Keresési csatornák

source: Search for similar
fi: Hae samankaltaisia
hu: Hasonló keresése

source: Search language:
fi: Hae kielellä:
hu: Keresési nyelv:

source: Search live broadcasts
fi: Hae suoria lähetyksiä
hu: Élő közvetítések keresése

source: Search playlists
fi: Hae toistolistoja
hu: Lejátszási listák keresése

source: Search region:
fi: Hae aluellta:
hu: Keresési terület:

source: Search results:
fi: Hakutulokset:
hu: Keresési eredmények:

source: Search videos
fi: Hae videoita
hu: Videók keresése

source: Shows
fi: Show:t
hu: műsorok

source: Sorry, download directory not exist! Please specify in the settings existing directory.
fi: Latauskansiota ei löydy! Määritä asetuksista olemassa oleva kansio.
hu: Sajnálom, a könyvtár letöltése nem létezik! Kérjük, adja meg a létező könyvtár beállításait.

source: Sorry, this file already exists: %s
fi: Tämä tiedosto on jo olemassa: %s
hu: Sajnáljuk, ez a fájl már létezik:%s

source: Sort search results by:
fi: Lajittele hakutulokset:
hu: A keresési eredmények rendezése:

source: South Korea
fi: Etelä-Korea

source: Spain
fi: Espanja

source: Specify the directory where save downloaded video files.
fi: Määritä kansio jonne videot tallennetaan.
hu: Adja meg azt a könyvtárat, ahol a letöltött videofájlokat mentheti.

source: Stop playing this movie?
fi: Pysäytä tämän videon toisto?
hu: Leállítani ezt a filmet?

source: Subscribe
fi: Seuraa
hu: Iratkozz fel

source: Subscribe this video channel
fi: Seuraa tätä videokanavaa
hu: Feliratkozás a videócsatornára

source: Subscribed!
fi: Seurattu!
hu: Jegyzett!

source: Sweden
fi: Ruotsi

source: Thailand
fi: Thaimaa

source: There was an error in creating entry list! Maybe try other feeds...
fi: Virhe hakutuloksissa! Kokeile toista syötettä...
hu: Hiba történt a belépési listák létrehozásában! Talán megpróbálhat más feedeket ...

source: There was an error in extract video url: %s
fi: Virhe videon url-osoitteessa: %s
hu: Hiba történt a videó kivonatának kivonásában: %s

source: There was an error!
fi: Virhe!
hu: Hiba történt!

source: Title
fi: Otsikko
hu: Cím

source: To perform authentication will need in a web browser open Google home page, and enter the code! Do you currently have Internet access on the other device and we can continue?
fi: Vahvistuksen suorittaminen vaatii internetselaimen ja Googlen kotisivun jonne koodi syötetään! Onko sinulla juuri nyt internettiä käytettävissä. Jatketaanko?
hu: A hitelesítés elvégzéséhez a webböngészőben meg kell nyitni a Google kezdőlapját, és be kell írnod a kódot! Jelenleg internetelérés van a másik eszközön, és folytathatjuk?

source: Top rated
fi: Suosituimmat
hu: Legjobbnak minősített

source: Try to exclude all restricted content from the search result.
fi: Hylkää rajoitettu sisältö hakutuloksista.
hu: Próbálja kizárni a korlátozott tartalmat a keresési eredményekből.

source: United States
fi: Yhdysvallat

source: Unsubscribe
fi: Älä seuraa
hu: Leiratkozás

source: Unsubscribed!
fi: Ei seurata!
hu: Leiratkozott!

source: Uploads
fi: Lataukset
hu: feltöltések

source: Use
fi: Käytä
hu: Használat

source: Video download started!
fi: Videon lataus alkoi!
hu: Videolejátszás indult!

source: Videos from this video channel
fi: Videoita tältä kanavalta
hu: Videók a videócsatornából

source: View count
fi: Näytä luku
hu: Megtekintések száma

source: Watch Later
fi: Katso myöhemmin

source: Watch YouTube videos
fi: Katso YouTube-videoita
hu: YouTube-videók megtekintése

source: What do you want to do?
fi: Mitä haluat tehdä?
hu: Mit akarsz csinálni?

source: What maximum resolution used when playing video, if available. If you have a slow Internet connection, you can use a lower resolution.
fi: Mikä on maksimi resoluutio videolle, jos on käytettävissä. Jos sinulla on hidas internetnopeus, voit pienentää resoluutiota.
hu: Milyen maximális felbontást használ a videó lejátszásakor, ha rendelkezésre áll. Ha lassú internetkapcsolatod van, kisebb felbontást használhatsz.

source: What to do when stop playback in videoplayer.
fi: Mitä tehdään kun videon toisto loppuu.
hu: Mi a teendő, ha leállítja a lejátszást a videolejátszóban?

source: What to do when the video ends.
fi: Mitä tehdään kun video loppuu.
hu: Mi a teendő, ha a videó véget ér.

source: When playback stop:
fi: Kun toisto loppuu:
hu: Amikor a lejátszás leáll:

source: When video ends:
fi: Kun video loppuu:
hu: Amikor a videó befejeződik:

source: Yes
fi: Kyllä
hu: Igen

source: Yes, but play next video
fi: Kyllä, mutta toista seuraava video
hu: Igen, de játssza le a következő videót

source: Yes, but play previous video
fi: Kyllä, mutta toista edellinen video
hu: Igen, de az előző videó lejátszása

source: You already authorized access for this plugin to your YouTube account. Do you want to do it again to update access data?
fi: Sinulla on jo pääsy YouTube-sisältöön. Haluatko päivittää kirjautumistietoja?
hu: Már engedélyezte a plugin hozzáférését YouTube-fiókjához. Szeretné újra elvégezni a hozzáférési adatok frissítését?

source: YouTube search
fi: YouTube haku
hu: YouTube keresés

source: YouTube setup
fi: YouTube asetukset
hu: YouTube beállítás

source: YouTube starting. Please wait...
fi: YouTube käynnistyy. Odota...
hu: A YouTube kezdődik. Kérlek várj...
